{"id":1191,"date":"2019-05-23T20:05:37","date_gmt":"2019-05-23T18:05:37","guid":{"rendered":"http:\/\/stepansuvorov.com\/blog\/?p=1191"},"modified":"2019-05-23T16:08:36","modified_gmt":"2019-05-23T14:08:36","slug":"%d0%a0%d0%b0%d0%b1%d0%be%d1%82%d0%b0-%d0%b2-envion-software-circle-development","status":"publish","type":"post","link":"https:\/\/stepansuvorov.com\/blog\/2019\/05\/%d0%a0%d0%b0%d0%b1%d0%be%d1%82%d0%b0-%d0%b2-envion-software-circle-development\/","title":{"rendered":"Работа в Envion Software (Circle Development)"},"content":{"rendered":"<p><img decoding=\"async\" loading=\"lazy\" class=\"alignnone size-full wp-image-2439\" src=\"https:\/\/stepansuvorov.com\/blog\/wp-content\/uploads\/2015\/03\/logo.png\" alt=\"envion-logo\" width=\"265\" height=\"41\" \/><\/p>\n<table width=\"236\">\n<tbody>\n<tr>\n<td>Компания:<\/td>\n<td width=\"100%\"><strong>EvionSoftware<\/strong> (харьковский филиал компании)<\/td>\n<\/tr>\n<tr>\n<td>Телефон:<\/td>\n<td width=\"100%\">739-24-04<\/td>\n<\/tr>\n<tr>\n<td nowrap=\"nowrap\">Веб-сайт:<\/td>\n<td width=\"100%\"><a title=\"http:\/\/envionsoftware.com\/\" href=\"http:\/\/envionsoftware.com\/\">envionsoftware.com <\/a><\/td>\n<\/tr>\n<tr>\n<td nowrap=\"nowrap\">Адрес:<\/td>\n<td width=\"100%\">один из корпусов завода <a title=\"http:\/\/goo.gl\/xUGXFh\" href=\"http:\/\/goo.gl\/xUGXFh\">Холодмаш<\/a><\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p>Наши отношения с компанией начались еще в далеком 2007 году, когда я писал диплом, плотно работал на фрилансе и собирался подыскивать постоянное место работы.<\/p>\n<p><!--more--><\/p>\n<p>Мне рассказал о компании Женя Караулов, с которым я ходил на рукопашный бой. Он не только рассказал, а настоятельно рекомендовал (буквально заставил :) ) зайти на собеседование. К этому моменту у меня уже была договоренность с компанией <a href=\"https:\/\/stepansuvorov.com\/blog\/2012\/07\/gameloft_\/\">gameloft<\/a> о выходе на работу через 2 недели. Решения я своего менять не собирался, но все же поддался на уговоры Жени, ведь действительно: что я теряю?<\/p>\n<p><em>(!Внимание: в данный момент, компания переехала в другой офис&#8230;.)<\/em><\/p>\n<p><em>(!Внимание 2: в 2016 произошел раскол и харьковское отделение практически полным составом ушло организовав свою компанию &#8211; <strong><a href=\"https:\/\/sciforce.solutions\/\">Sciforce<\/a><\/strong>, поэтому прошу воспринимать этот пост не как отзыв, а скорее как мемуары )<\/em><\/p>\n<p>В общем приехал я по адресу компании &#8211; станция метро Завод им. Малышева, территория завода Холодмаш. Проходная, типичная заводская проходная. Женя вышел встретить, ибо сам бы я мог и не найти дорогу по лабиринтам лестниц и переходов. Внутренности здания как и наружность кричали о том, что ремонта тут не было со времен развала союза.<\/p>\n<p>Офис представлял из себя отремонтированные комнаты разбросанные по не отремонтированному этажу(или даже скорее коридору). Коллектив показался с первого взгляда довольно дружный: на момент моего прихода в офисе шло активное обсуждение того, кто пойдет выносить елку оставшуюся с нового года.<\/p>\n<p>Сначала был тест на знание PHP, который показался мне совсем не сложным: ну возможно всего несколько вопросов, на которые я не знал точного ответа.<\/p>\n<p>Собеседовать меня взялся суровый разработчик(<em>да, Макс, это ты<\/em>), после каждого ответа он смотрел куда-то сквозь меня в стенку и переодически расширял глаза(то ли от удивления, то ли не знаю от чего), но по его реакции вообще нельзя было определить на сколько я в тему что-то сказал. Также попросилась присутствовать Ксения &#8211; PHP лид проекта, на который меня брали. Сейчас уже смешно вспоминать, я тогда уверенно завалил вопросы по ООП и показал, что глубоко если копнуть в MySQL, то тоже не все понимаю.<\/p>\n<p>Далее Ксения меня повела показывать проект. Какой он сложный, многомодульный и интересный. Фраза, которую я помню до сих пор  &#8211; &#8220;Нас попросили не использовать ajax, но мы тут немного хитрим и (!внимание) используем ajax, <span style=\"text-decoration: underline;\">но в браузере показываем как будто страница перегружается<\/span>&#8220;.<\/p>\n<p>Еще мне показали будущую комнату для нашей PHP команды, где и лежала та елка, которая еще не была выкинута.<\/p>\n<p>Продолжением презентации компании стало аварийное выключение света. Свет конечно где-то через минуту появился снова, но &#8220;осадочек остался&#8221;.<\/p>\n<p>Тогда я познакомился с директором компании, Инной Борисовной. Она озвучила условия, на которых компания радостно готова принять меня в свои ряды.<\/p>\n<p>Честно говоря, на тот момент я не себе совсем не представлял ИТ рынка, условий, в которых работают разработчики разных компании. Это вообще была моя первая работа фул-тайм в офисе. Поэтому сравнив по сути только мебель с gameloft, я подумал что геймлофт понадежнее будет, а эта компания из нескольких комнат в коридоре может и перестать существовать через несколько месяцев. Забегая наперед скажу, что был очень не прав.<\/p>\n<p>Вероятно в 2008 году еще не было такого бешеного спроса на программистов, поэтому я тогда думал о стабильности. Сейчас даже для многих начинающих программистов это уже звучит смешно.<\/p>\n<p>Вот так я и пошел работать в <a href=\"https:\/\/stepansuvorov.com\/blog\/2012\/07\/gameloft_\/\">геймлофт<\/a>, потом в <a title=\"он же RightFusion\" href=\"https:\/\/stepansuvorov.com\/blog\/2012\/12\/rightfusion%D0%BE%D0%BD-%D0%B6%D0%B5-%D1%80%D0%B0%D0%BD%D0%B5%D0%B5-mediatek\/\">медиатек<\/a>, и потом судьба снова меня привела в компанию Жени. Снова списались с Женей, он сказал что сейчас срочно ищут PHP разработчика и приглашал зайти в гости. Я был приятно удивлен узнав, что компания до сих пор существует и набирает новых людей. Вторым сюрпризом стало, что там до сих пор работала Ксения, которая мне презентовала проект. Она мне сама позвонила и договорилась о интервью. Ну что ж подумал я: если люди от туда не уходят &#8211; это хороший признак.<\/p>\n<p>Человек нужен был очень срочно, поэтому Ксения даже вышла в день своего отпуска чтобы провести интервью. Она же меня встретила на проходной и повела в офис. Я подумал что подзабыл что-то, так как в прошлый раз мы сразу зашли в здание, а в этот раз пошли куда-то по территории завода. Оказалось, что компания переехала в другое здание.<\/p>\n<p>Когда я вошел в помещение &#8211; был, опять таки, приятно удивлен: за эти 3 года офис компании серьезно изменился, из тех &#8220;3х комнат&#8221;. Длинный коридор, множество комнат, большая кухня и &#8230; та-та-та-там &#8230; столик для настольного тенниса. Офис мне однозначно понравился.<\/p>\n<p>Как и 3 года назад мне дали PHP тест, который почти не изменился. И который я, понятное дело, прошел еще быстрее. В этот раз он для меня был даже немного скучным. Но, конечно, приятно было отметить, что в знаниях я набрал.<\/p>\n<p>Собеседовал меня кроме Ксении еще Виктор Колченко. С которым мы (!внезапно) учились в универе на одном потоке, мир тесен.<\/p>\n<p>Поднабравшись в Медиатеке знаний и опыта, я довольно уверено чувствовал себя на собеседовании. Ну и тем более у людей ведущих собеседование не было цели меня завалить, а наоборот &#8211; им нужен был срочно человек. Интересно, что на вопросах по JavaScript я таки немного просел. Кто бы мог подумать, что через 2 года это станет моей основной технологией, которой я буду обучать и собеседовать других разработчиков.<\/p>\n<p>Еще был разговор с Инной Борисовной. Похоже я успешно прошел собеседование. И меня стали убеждать поработать в компании. Но это не нужно было делать, так как столик для настольного тенниса сыграл свое дело.<\/p>\n<h2>Первые дни работы в компании.<\/h2>\n<p>Комната номер 3, или как ее прозвали &#8220;комната ПХПистов&#8221;. Светло, просторно и милоурбанистический вид из окна.  Сразу удивили 2 вещи: странное расположение столов(по периметру комнаты, так что сидеть лицом к стене) и крайне мелкий монитор (в <a title=\"https:\/\/stepansuvorov.com\/blog\/2012\/12\/rightfusion%D0%BE%D0%BD-%D0%B6%D0%B5-%D1%80%D0%B0%D0%BD%D0%B5%D0%B5-mediatek\/\" href=\"https:\/\/stepansuvorov.com\/blog\/2012\/12\/rightfusion%D0%BE%D0%BD-%D0%B6%D0%B5-%D1%80%D0%B0%D0%BD%D0%B5%D0%B5-mediatek\/\">Медиатеке<\/a> я уже привык работать на 2х, один из которых &#8211; широкоформатный ). Так как железо было у всех одинаковое, я решил не наглеть выпрашивая себе лучший монитор, а просто взял и купил; а компания потом обеспечила видеокартой, чтобы можно было подключить 2. (думаю стоит напомнить, что был 2010\/2011 год и широкоформатные мониторы были редкостью в ИТшных компаниях).<\/p>\n<p>На счет столов ситуацию так и не удалось разрешить. Увы, это какое-то катастрофическое недопонимание или нежелание менеджмента понимать, что таким образом не удастся повысить производительность труда, а только, вероятно, создать дискомфорт для работы. Не &#8220;по фэншую это в общем, не по фэншую&#8221;.<\/p>\n<p>Так как большая часть сервисов для проекта запускалась на Linux или с помощью Linux, я понял что это идеальный момент перескочить с винды на убунту, как основную операционную систему, что уже давно собирался сделать.<\/p>\n<h2>Знакомство с проектом<\/h2>\n<p>Сказать, что для запуска проекта нужно было поднимать 9 виртуальных серверов со своими встроенными сервисами &#8211; это не сказать ничего. Изначально архитектура предусматривала масштабируемость и нагрузки сравнимыми вероятно только с сервисами гугла.<\/p>\n<p>А всего-то мы делали ассет(файл) менеджмент, аналог которому мы сейчас можем назвать &#8211; Dropbox, плюс функцию коммуникации между пользователями системы и что-то типа менеджмента задач на создание этих ассетов.<\/p>\n<p>Еще мне понравилось что весь Javascript код проекта был помещен в один файл &#8211; script.js на 7 тысяч строк. Да, вы можете подумать, что это скомпилированный файл, а исходники где-то лежать отдельно, но нет &#8211; это и были исходники.<\/p>\n<p>Что касается фреймворка, подход был тоже довольно суровый &#8211; и на сервере и на клиенте был написан свой фреймворк.<\/p>\n<p>Технической документации понятное дело не было, все что было из общей документации &#8211; это набор файлов, которые описывали какие-то бизнес процессы, но и те устарели.<\/p>\n<p>Вот такой вот Challenge мне предстоял.<\/p>\n<h2>Атмосфера<\/h2>\n<p>Я много раз повторял, в компании была реально семейная атмосфера. Все решали вместе. Все делали вместе. Проекты и не только. А какие тематические хорошо продуманные были корпоративы; компании, которые заказывают специальных организаторов могли бы только позавидовать.<\/p>\n<p>&#8230;<\/p>\n<p>&#8230;<\/p>\n<p>&#8230;<\/p>\n<h2>На этом повествование внезапно заканчивается&#8230;<\/h2>\n<p>спустя почти 10 лет, могу признаться себе, что я так и не дописал этот пост. повествование оборвалось в момент, когда я решил остановиться и дополнить историю фотографиями. Запросив фотографии, я узнал что в компании сейчас что-то непонятное (в плохом смысле этого слова) происходит и, чтобы не сгущать плохими приметами тучи, я решил отложить написание поста. После я узнал что компания распалась, ну точне костяк харьковской команды ушел и организовал свою компанию &#8211; <a href=\"https:\/\/sciforce.solutions\/\">SciForce<\/a>. Поэтому я серьезно задумался: стоит ли дописать этот пост (пишу как оправдание лени).<\/p>\n<p>Наткнувшись сейчас в архиве картинок на старый логотип компании, я вспомнил, что у меня по прежнему хранятся эти не завершенные заметки, поэтому решил опубликовать эти несколько абзацев из черновика статьи, которой не суждено было быть дописанной.<\/p>\n<p><strong> <\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Компания: EvionSoftware (харьковский филиал компании) Телефон: 739-24-04 Веб-сайт: envionsoftware.com  Адрес: один из корпусов завода Холодмаш Наши отношения с компанией начались еще в далеком 2007 году, когда я писал диплом, плотно работал на фрилансе и собирался подыскивать постоянное место работы.<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[30],"tags":[],"_links":{"self":[{"href":"https:\/\/stepansuvorov.com\/blog\/wp-json\/wp\/v2\/posts\/1191"}],"collection":[{"href":"https:\/\/stepansuvorov.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/stepansuvorov.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/stepansuvorov.com\/blog\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/stepansuvorov.com\/blog\/wp-json\/wp\/v2\/comments?post=1191"}],"version-history":[{"count":14,"href":"https:\/\/stepansuvorov.com\/blog\/wp-json\/wp\/v2\/posts\/1191\/revisions"}],"predecessor-version":[{"id":3557,"href":"https:\/\/stepansuvorov.com\/blog\/wp-json\/wp\/v2\/posts\/1191\/revisions\/3557"}],"wp:attachment":[{"href":"https:\/\/stepansuvorov.com\/blog\/wp-json\/wp\/v2\/media?parent=1191"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/stepansuvorov.com\/blog\/wp-json\/wp\/v2\/categories?post=1191"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/stepansuvorov.com\/blog\/wp-json\/wp\/v2\/tags?post=1191"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}