{"id":429,"date":"2012-08-11T21:04:14","date_gmt":"2012-08-11T21:04:14","guid":{"rendered":"http:\/\/stepansuvorov.com\/blog\/?p=429"},"modified":"2012-08-11T21:04:14","modified_gmt":"2012-08-11T21:04:14","slug":"program-ace","status":"publish","type":"post","link":"https:\/\/stepansuvorov.com\/blog\/2012\/08\/program-ace\/","title":{"rendered":"Program-Ace"},"content":{"rendered":"<p><img decoding=\"async\" loading=\"lazy\" class=\"alignnone size-full wp-image-430\" title=\"program_ace\" src=\"https:\/\/stepansuvorov.com\/blog\/wp-content\/uploads\/2012\/08\/program_ace.jpg\" alt=\"program ace logo\" width=\"234\" height=\"79\" \/><\/p>\n<table width=\"236\">\n<tbody>\n<tr>\n<td>Компания:<\/td>\n<td width=\"100%\">Program-Ace<\/td>\n<\/tr>\n<tr>\n<td>Телефон:<\/td>\n<td width=\"100%\">(057) 7556-556<\/td>\n<\/tr>\n<tr>\n<td nowrap=\"nowrap\">Веб-сайт:<\/td>\n<td width=\"100%\"><a href=\"http:\/\/www.program-ace.com\">program-ace.com<\/a> (<a href=\"http:\/\/www.program-ace.com.ua\/\">program-ace.com.ua<\/a>)<\/td>\n<\/tr>\n<tr>\n<td nowrap=\"nowrap\">Адрес:<\/td>\n<td width=\"100%\">61052, Харьков, Полтавский шлях, 56 (9-й этаж)<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p>Компания<strong> Program-Ace<\/strong> могла стать моей первой компанией, если бы отдел работы с персоналом был побыстрее. А так, воспользовавшись их задержкой, меня пригласила компания <a title=\"работа в gameloft\" href=\"https:\/\/stepansuvorov.com\/blog\/2012\/07\/gameloft_\/\">gameloft<\/a>, куда я и пошел работать. Но все же вернемся к <strong> Program-Ace<\/strong>, куда мы пришли вместе с одногруппником осенью 2007 года. Нам тут же выдали анкеты листов по 5, где мы должны были заполнить всю информацию включая опыт работы, знакомые технологии, вредные привычки, паспортные данные, налоговый код, по-моему, тоже. Старательно заполнив все галочки мы сдали бланки и нам сказали что свяжутся с нами. И действительно, где-то в течении недели со мной связались и пригласили пройти собеседование.<\/p>\n<p><!--more-->Сначала был тест. И <strong>тест<\/strong> был обо всем: PHP, JavaScript, HTML, SQL. Вопросы не очень сложные &#8211; ну это и логично: тест был для начинающего разработчика. Почти сразу же после прохождения теста началось собеседование.<\/p>\n<p>Именно тогда я познакомился с <strong>Дмитрием Ефименко<\/strong> &#8211; харьковской легендой в области сайтостроения и техническим директором отдела веб разработки. Это было мое первое собеседование, к которому я подходил имея уже за плечами несколько лет работы на фрилансе и чувством того, что я уже знаю все о PHP, ну или почти все. Вот тут мне Дима крылья моей самоуверенности и подрезал, по пунктам разложив пробелы в знаниях и, особенно, понимании некоторых вещей. Мне был интересно с ним общаться, своим интервью он не только установил мой уровень, но и показал что в этой компании я смогу научиться большему. Благодаря нему я дал согласие на предложение <strong>Program-Ace<\/strong>. Но, как было отмечено выше, не сложилось что-то у них.<\/p>\n<p>В начале 2012 судьба делает новый виток: меня снова приглашают в компанию <strong>Program-Ace<\/strong>, правда теперь уже не junior-разработчиком, а senior.<\/p>\n<p>Офис компании остался на том же месте, правда после кризиса немного уменьшилось количество комнат. Меня радостно встретили и <em>***барабанная дробь***<\/em> дали туже анкету на 5 листов, где нужно было заполнять все личные данные. В этот раз я ограничился минимумом, которые меня таки уговорили заполнить. После чего шел тест. Думаю вы уже поняли что это был тот же самый тест, что и пять лет назад, только по PHP в этот раз я выбрал вопросы для старшего разработчика, а по HTML\/JavaScript\/SQL похоже нет теста на старшего разработчика. Несмотря на большое количество вопросов &#8211; справился с тестом довольно быстро. Завис только на одном вопросе, позже мне объяснили, что он был основан на работе с указателями в Oracle.<\/p>\n<p>Через несколько дней пришло письмо &#8220;Поздравляем, Вы прошли предварительный отбор.&#8221; с приглашением на собеседование. В этот раз собеседовал меня <strong>Евгений Борщ<\/strong>(к тому моменту Дмитрий Ефименко уже покинул компанию). Стоит отметить: тоже грамотный технический специалист, на котором сейчас держится веб-отдел. Были только общие вопросы: с какими технологиями и фреймворками работал, какие методики распределения нагрузки применял. Еще немного поговорили на английском. Рассказали мне о проекте, на который рассматривают меня лидом &#8211; что-то похоже на google adsence, только ориентированное на специфический контент-трафик.<\/p>\n<p>В общем, не очень заинтересовали. Проект, над которым я работал, был интереснее, ИМХО. Вот так я второй раз не пошел работать в <strong>Program-Ace.<\/strong><\/p>\n<p>А на выходе из офиса меня ждал сюрприз: оказалось главный вход офисного центра закрывается в 19-00 и потом можно выйти только через черный ход в другом крыле. Но меня-то никто не предупредил. Представьте мое изумления когда я спускаюсь на лифте, а на первом этаже свет выключен и дверь закрыта. Пришлось подниматься назад в офис и спрашивать у охранника WTF? Он мне объяснил ситуацию. Пошел в другое крыло искать этот ***ый запасной лифт. Нашел &#8211; вызвал &#8211; не приходит.  Добавлю, что я договорился на встречу с девушкой, и уже опаздывал из-за приколов офисного центра. Побежал по черной лестнице. Вырвался! После такого &#8220;квеста&#8221; подумал &#8220;никогда больше сюда не вернусь!&#8221;.<\/p>\n<p>Теперь немного объективной информации, так как в инетах неоднократно поднимался <a href=\"http:\/\/www.rsdn.ru\/forum\/flame\/2520515.flat.1.aspx\">срач<\/a> по поводу работы в данной компании. Внесу свое понимание вопроса.<\/p>\n<p>На сколько мне известно: в компании было 2 кризиса, что повлекло за собой массовый отток кадров. О первом говорить не буду, так как у самого мало информации, возможно меня кто-то дополнит в комментариях. А по второму &#8211; была следующая ситуация: <strong>Program-Ace<\/strong> поставил почти все на очень крупный проект, фактически вся компания работала на него. Но тут &#8211; бац! &#8211; кризис. И у заказчика уже нет денег на спонсирование этого проекта. Вот тут и начались проблемы: ушли люди, которым вовремя не заплатили &#8211; это привело к тому, что начали рушиться и соседние проекты, стали уходить уже заказчики. Но сейчас  ситуация стабилизировать и компания снова начала расширяться. У меня там работает товарищ уже больше года и его все устраивает.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Компания: Program-Ace Телефон: (057) 7556-556 Веб-сайт: program-ace.com (program-ace.com.ua) Адрес: 61052, Харьков, Полтавский шлях, 56 (9-й этаж) Компания Program-Ace могла стать моей первой компанией, если бы отдел работы с персоналом был побыстрее. А так, воспользовавшись их задержкой, меня пригласила компания gameloft, &hellip; <a href=\"https:\/\/stepansuvorov.com\/blog\/2012\/08\/program-ace\/\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[30],"tags":[61,37],"_links":{"self":[{"href":"https:\/\/stepansuvorov.com\/blog\/wp-json\/wp\/v2\/posts\/429"}],"collection":[{"href":"https:\/\/stepansuvorov.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/stepansuvorov.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/stepansuvorov.com\/blog\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/stepansuvorov.com\/blog\/wp-json\/wp\/v2\/comments?post=429"}],"version-history":[{"count":2,"href":"https:\/\/stepansuvorov.com\/blog\/wp-json\/wp\/v2\/posts\/429\/revisions"}],"predecessor-version":[{"id":433,"href":"https:\/\/stepansuvorov.com\/blog\/wp-json\/wp\/v2\/posts\/429\/revisions\/433"}],"wp:attachment":[{"href":"https:\/\/stepansuvorov.com\/blog\/wp-json\/wp\/v2\/media?parent=429"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/stepansuvorov.com\/blog\/wp-json\/wp\/v2\/categories?post=429"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/stepansuvorov.com\/blog\/wp-json\/wp\/v2\/tags?post=429"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}